f35a/openfoam/case/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions [ 0 0 -1 0 0 0 0 ];

internalField uniform $turbulentOmega;

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       $internalField;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }
    
    sym
    {
        type        symmetryPlane;
    }

    walls
    {
        type        slip;
    }

    model
    {
        type        omegaWallFunction;
        value       $internalField;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************* //
